In [1]:
import pandas as pd
import numpy as np

1. In the cell below, create a 3x3 Data Frame with each value as '1' and add unique column names.

In [2]:
df=pd.DataFrame()
col_names=['one','two','three']
for col in col_names:
    df[col]=[1,1,1]
df

   one  two  three
0    1    1      1
1    1    1      1
2    1    1      1

2. In the cell below, find the type of the first row of the first column of your new DataFrame.

In [3]:
df.iloc[0]

one      1
two      1
three    1
Name: 0, dtype: int64

3. In the cell below, find and print the value of the center cell of your DataFrame.

In [4]:
df.iloc[1,1]

1

4. In the cell below, create a list with elements 'a', 'b', and 'c', transform it into a DataFrame, and find the type of the second row of the first column.

In [5]:
list_elements=['a','b','c']
df2=pd.DataFrame(list_elements)
df2.iloc[1]

0    b
Name: 1, dtype: object

5. In the cell below, create a for loop that will create a list of length 10 with numbers ranging from 0 to 9, then, convert this new list into a DataFrame.

In [6]:
list10=[]
for i in range(0,10):
    list10.append(i)
df3=pd.DataFrame(list10)
df3

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

6. In the cell below, create a new 4x4 DataFrame of random numbers between 0 and 1.

In [7]:
a1=np.random.rand(16).reshape(4,4)
df4=pd.DataFrame(a1)
df4

          0         1         2         3
0  0.502821  0.751469  0.971449  0.330883
1  0.524935  0.211212  0.783260  0.641503
2  0.027203  0.954906  0.810736  0.438138
3  0.708081  0.011700  0.629040  0.367262

7. In the cell below, print the 2nd row of the 3rd column.

In [8]:
df4.iloc[1,2]

0.7832601404043379

8. In the cell below, create a new DataFrame using only the 1st and 3rd column.

In [9]:
print(df4.columns)
df5=df4[[0,2]]
df5

RangeIndex(start=0, stop=4, step=1)

          0         2
0  0.502821  0.971449
1  0.524935  0.783260
2  0.027203  0.810736
3  0.708081  0.629040

9. In the cell below, create a new DataFrame from problem 6 where you include only rows where the first column is greater than .4, your answer may return an empty DataFrame.

In [10]:
df6=df4[df4[0]>.4]
df6

          0         1         2         3
0  0.502821  0.751469  0.971449  0.330883
1  0.524935  0.211212  0.783260  0.641503
3  0.708081  0.011700  0.629040  0.367262

10. In the cell below, using the iloc method, pring the 4th row of the data frame from problem 6.

In [11]:
df4.iloc[3]

0    0.708081
1    0.011700
2    0.629040
3    0.367262
Name: 3, dtype: float64